In [1]:
#Experiment_No:-3

In [2]:
#Aim:-To perform Finding Statistical Descriptions of given data set using Pandas

In [3]:
#Name:-Vipul Ajabrao Sonone

In [5]:
#Rollno:-59

In [6]:
#Section:-B

In [7]:
#Year:-3rd

In [8]:
import pandas as pd

In [9]:
import numpy as np

In [10]:
import matplotlib.pyplot as plt

In [11]:
import seaborn as sns

In [12]:
import numpy as np

In [13]:
import os

In [14]:
os.getcwd()

'C:\\Users\\vipul'

In [15]:
os.chdir('C:\\Users\\vipul\\OneDrive\\Desktop')

In [16]:
df=pd.read_csv("Salary_dataset.csv")

In [17]:
df.head(10)

   Unnamed: 0  YearsExperience   Salary
0           0              1.2  39344.0
1           1              1.4  46206.0
2           2              1.6  37732.0
3           3              2.1  43526.0
4           4              2.3  39892.0
5           5              3.0  56643.0
6           6              3.1  60151.0
7           7              3.3  54446.0
8           8              3.3  64446.0
9           9              3.8  57190.0

In [18]:
df.tail(10)

    Unnamed: 0  YearsExperience    Salary
20          20              6.9   91739.0
21          21              7.2   98274.0
22          22              8.0  101303.0
23          23              8.3  113813.0
24          24              8.8  109432.0
25          25              9.1  105583.0
26          26              9.6  116970.0
27          27              9.7  112636.0
28          28             10.4  122392.0
29          29             10.6  121873.0

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       30 non-null     int64
 1   YearsExperience  30 non-null     float64
 2   Salary           30 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 848.0 bytes

In [20]:
df.describe()

       Unnamed: 0  YearsExperience         Salary
count   30.000000        30.000000      30.000000
mean    14.500000         5.413333   76004.000000
std      8.803408         2.837888   27414.429785
min      0.000000         1.200000   37732.000000
25%      7.250000         3.300000   56721.750000
50%     14.500000         4.800000   65238.000000
75%     21.750000         7.800000  100545.750000
max     29.000000        10.600000  122392.000000

In [21]:
df.shape

(30, 3)

In [22]:
df.size

90

In [23]:
df.ndim

2

In [24]:
#Using Numpy
mean=np.mean(df)
median=np.median(df)
variance=np.var(df)
std_dev=np.std(df)

In [25]:
#Using pandas
df=pd.DataFrame(df,columns=["df"])
summary_stats=df.describe()

In [26]:
print(f"Mean:{mean}")

Mean:Unnamed: 0            14.500000
YearsExperience        5.413333
Salary             76004.000000
dtype: float64

In [27]:
print(f"Median:{median}")

Median:14.5

In [28]:
print(f"Standard Deviation:{std_dev}")

Standard Deviation:Unnamed: 0             8.655441
YearsExperience        2.790189
Salary             26953.650249
dtype: float64

In [29]:
print(f"Variance:{variance}")

Variance:Unnamed: 0         7.491667e+01
YearsExperience    7.785156e+00
Salary             7.264993e+08
dtype: float64

In [30]:
print(f"\nSummary Statistics:")

Summary Statistics:

In [32]:
print(summary_stats)

        df
count  0.0
mean   NaN
std    NaN
min    NaN
25%    NaN
50%    NaN
75%    NaN
max    NaN